workOut/app/controllers/exercises_controller.rb

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 15 LIMIT 1
SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`plan_id` = 15
---
  def index
    @plan = Plan.find(params[:plan_id])
    @exercises = Exercise.find_all_by_plan_id(@plan.id)

SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 1 LIMIT 1
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 15 LIMIT 1
---
  def new
    @plan = Plan.find(params[:plan_id])

SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 11 LIMIT 1
---
  def edit
    @exercise = Exercise.find(params[:id])

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 15 LIMIT 1
INSERT INTO `exercises` (`created_at`, `name`, `plan_id`, `reps_or_min`, `sets`, `updated_at`) VALUES ('2012-11-14 20:12:24', 'Push up', NULL, 3, 2, '2012-11-14 20:12:24')
---
  def create
    @plan = Plan.find(params[:plan_id])
    @exercise = Exercise.new

    @exercise.plan_id = @plan.id
    if @exercise.update_attributes(params[:exercise])
      respond_to do |format|
        if @exercise.save

SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 11 LIMIT 1
UPDATE `exercises` SET `name` = 'fat', `sets` = 2, `reps_or_min` = 1, `updated_at` = '2012-11-15 14:58:23' WHERE `exercises`.`id` = 14
---
  def update
    @exercise = Exercise.find(params[:id])

    respond_to do |format|
      if @exercise.update_attributes(params[:exercise])

SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 11 LIMIT 1
SELECT `plans`.* FROM `plans` INNER JOIN `exercises_plans` ON `plans`.`id` = `exercises_plans`.`plan_id` WHERE `exercises_plans`.`exercise_id` = 11
DELETE FROM `exercises` WHERE `exercises`.`id` = 1
---
  def destroy
    @exercise = Exercise.find(params[:id])
    @plan = Plan.find(@exercise.plan_id)
    Exercise.delete(@exercise.id)