workOut/app/controllers/exercises_controller.rb

  def show
    @exercise = Exercise.find(params[:id])
    @plan = Plan.find(params[:id])
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 9 LIMIT 1