workOut/app/controllers/plans_controller.rb

  def index
    @user = User.find(params[:user_id])                     # find the current user in session
    @plans = Plan.find_all_by_user_id(@user.id)             # find the ALL the plans by this user
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `plans`.* FROM `plans` WHERE `plans`.`user_id` = 2 LIMIT 1

  def show
    @user = User.find(session[:user_id])                      # find the current user
    @plan = Plan.find(params[:id])                            # find the current plan owned the current user
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 30 LIMIT 1

  def new
    @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def edit
    @plan = Plan.find(params[:id])
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 15 LIMIT 1

  def create
    @user = User.find(session[:user_id])
    @plan = Plan.new

    @plan.user_id = @user.id
    if @plan.update_attributes(params[:plan])
      if @plan.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
INSERT INTO `plans` (`created_at`, `description`, `fitness_area`, `title`, `updated_at`, `user_id`) VALUES ('2012-11-13 21:26:55', '', '', '', '2012-11-13 21:26:55', NULL)
INSERT INTO `users` (`age`, `created_at`, `crypted_password`, `email`, `foot_height`, `gender`, `inches_height`, `salt`, `updated_at`, `username`, `weight`) VALUES (NULL, '2012-11-14 18:01:57', NULL, NULL, NULL, NULL, NULL, NULL, '2012-11-14 18:01:57', NULL, NULL)

  def update
    @plan = Plan.find(params[:id])

    respond_to do |format|
      if @plan.update_attributes(params[:plan])
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 15 LIMIT 1
UPDATE `plans` SET `description` = 'When I\'m Fat!', `updated_at` = '2012-11-14 19:53:26' WHERE `plans`.`id` = 15

  def destroy
    @user = User.find(session[:user_id])
    @plan = Plan.find(params[:id])
    @plan.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 41 LIMIT 1
DELETE FROM `plans` WHERE `plans`.`id` = 41