workOut/app/controllers/users_controller.rb

  def my_plans
    @user = User.find(params[:id])
    @my_plans = Plan.find_all_by_user_id(@user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `plans`.* FROM `plans` WHERE `plans`.`user_id` = 1

  def add_plan
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def index
    @user = User.find_by_id(params[:id])           # show me only the current user
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`age`, `created_at`, `crypted_password`, `email`, `foot_height`, `gender`, `inches_height`, `salt`, `updated_at`, `username`, `weight`) VALUES (NULL, '2012-11-14 16:18:48', '$2a$10$x.tMnwLG3Fg.7mLalkbtOOyZDprDVSZTCFgsFCJKfjYFgI735AxFS', 'raul.emmanuel.gil@gmail.com', NULL, NULL, NULL, 'jPMWzb4ZbZtX3nHt7wKy', '2012-11-14 16:18:48', 'raulgil90', NULL)